#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Nokos/terraform-github/runs/run-XM6Qaa265dBKUVF7

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources]
azurerm_automation_account.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal]
azurerm_network_interface.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/networkInterfaces/testTF-nic]
azurerm_windows_virtual_machine.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Compute/virtualMachines/testTF-vm]
azurerm_automation_schedule.one-time: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/schedules/testTF-one-time]
azurerm_automation_runbook.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/runbooks/Get-AzureVMTutorial]
azurerm_automation_schedule.hour: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/schedules/testTF-hour]
azurerm_automation_job_schedule.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/jobSchedules/44686882-b52c-49f8-a7ce-2f9409b2354a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_automation_account.main has changed
  ~ resource "azurerm_automation_account" "main" {
        id                            = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc"
        name                          = "testTF-autoacc"
      + tags                          = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_automation_job_schedule.main has changed
  ~ resource "azurerm_automation_job_schedule" "main" {
        id                      = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/jobSchedules/44686882-b52c-49f8-a7ce-2f9409b2354a"
      + parameters              = {}
        # (5 unchanged attributes hidden)
    }

  # azurerm_automation_runbook.main has changed
  ~ resource "azurerm_automation_runbook" "main" {
        id                      = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/runbooks/Get-AzureVMTutorial"
      ~ job_schedule            = [
          + {
              + job_schedule_id = "44686882-b52c-49f8-a7ce-2f9409b2354a"
              + parameters      = {}
              + run_on          = ""
              + schedule_name   = "testTF-hour"
            },
        ]
        name                    = "Get-AzureVMTutorial"
      + tags                    = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_automation_schedule.hour has changed
  ~ resource "azurerm_automation_schedule" "hour" {
      ~ expiry_time             = "9999-12-31T23:59:00Z" -> "9999-12-31T18:59:00-05:00"
        id                      = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/schedules/testTF-hour"
        name                    = "testTF-hour"
      ~ start_time              = "2022-05-08T03:06:00Z" -> "2022-05-08T03:06:00-04:00"
      ~ timezone                = "Etc/UTC" -> "America/Toronto"
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_automation_schedule.hour will be updated in-place
  ~ resource "azurerm_automation_schedule" "hour" {
        id                      = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Automation/automationAccounts/testTF-autoacc/schedules/testTF-hour"
        name                    = "testTF-hour"
      ~ timezone                = "America/Toronto" -> "Etc/UTC"
        # (6 unchanged attributes hidden)
    }

  # azurerm_logic_app_action_http.main will be created
  + resource "azurerm_logic_app_action_http" "main" {
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + method       = "DELETE"
      + name         = "clear-stale-objects"
      + uri          = "http://example.com/clear-stable-objects"
    }

  # azurerm_logic_app_trigger_recurrence.hourly will be created
  + resource "azurerm_logic_app_trigger_recurrence" "hourly" {
      + frequency    = "Hour"
      + id           = (known after apply)
      + interval     = 1
      + logic_app_id = (known after apply)
      + name         = "run-every-hour"
      + time_zone    = (known after apply)
    }

  # azurerm_logic_app_workflow.example will be created
  + resource "azurerm_logic_app_workflow" "example" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "testTF-logicapp"
      + resource_group_name             = "testTF-resources"
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"
    }

Plan: 3 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @Nokoshan, Action: `pull_request`*